backend/tests/load/artillery-config.yml
config:
  target: "http://localhost:3000"
  phases:
    # Warm-up phase: Gradually increase load
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp-up phase: Increase to moderate load
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp-up"
    
    # Sustained load: 100 concurrent users
    - duration: 300
      arrivalRate: 100
      name: "Sustained load - 100 concurrent requests"
    
    # Peak load: Spike to 200 concurrent users
    - duration: 60
      arrivalRate: 200
      name: "Peak load - 200 concurrent requests"
    
    # Cool-down phase
    - duration: 60
      arrivalRate: 10
      name: "Cool-down"

  processor: "./tests/load/artillery-processor.js"
  
  # Performance thresholds
  ensure:
    maxErrorRate: 1  # Maximum 1% error rate
    p95: 500        # 95th percentile response time < 500ms
    p99: 1000       # 99th percentile response time < 1000ms

  # Variables
  variables:
    apiBaseUrl: "http://localhost:3000/api"
    graphqlUrl: "http://localhost:3000/graphql"

  # HTTP settings
  http:
    timeout: 10
    pool: 50  # Connection pool size

  # Payload configuration
  payload:
    path: "./tests/load/test-data.csv"
    fields:
      - userId
      - authToken
      - articleId
    order: random
    skipHeader: true

scenarios:
  # Scenario 1: Workflow Management
  - name: "AI Workflow Management"
    weight: 30
    flow:
      - get:
          url: "/api/ai/orchestrator/workflows"
          headers:
            Authorization: "Bearer {{ authToken }}"
          capture:
            - json: "$[0].id"
              as: "workflowId"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: workflows

      - post:
          url: "/api/ai/orchestrator/workflows"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          json:
            type: "CONTENT_CREATION"
            input:
              topic: "Load test article {{ $randomString() }}"
              category: "MARKET_NEWS"
          capture:
            - json: "$.id"
              as: "newWorkflowId"
          expect:
            - statusCode: 201
            - hasProperty: id

      - get:
          url: "/api/ai/orchestrator/workflows/{{ newWorkflowId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
            - hasProperty: id

      - think: 2  # Wait 2 seconds

      - get:
          url: "/api/ai/orchestrator/workflows/{{ newWorkflowId }}/tasks"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
            - hasProperty: tasks

  # Scenario 2: Translation Requests
  - name: "Article Translations"
    weight: 25
    flow:
      - get:
          url: "/api/article-translations/{{ articleId }}/en"
          expect:
            - statusCode: 200
            - contentType: json

      - get:
          url: "/api/article-translations/{{ articleId }}/sw"
          expect:
            - statusCode: 200

      - get:
          url: "/api/article-translations/{{ articleId }}/ha"
          expect:
            - statusCode: 200

      - get:
          url: "/api/article-translations/{{ articleId }}"
          expect:
            - statusCode: 200
            - hasProperty: translations

  # Scenario 3: Market Insights
  - name: "AI Market Insights"
    weight: 20
    flow:
      - get:
          url: "/api/ai-market-insights/sentiment/BTC"
          expect:
            - statusCode: 200
            - hasProperty: sentiment

      - get:
          url: "/api/ai-market-insights/sentiment/ETH"
          expect:
            - statusCode: 200

      - get:
          url: "/api/ai-market-insights/trending"
          expect:
            - statusCode: 200
            - hasProperty: trending

      - think: 1

      - get:
          url: "/api/ai-market-insights/whale-activity"
          expect:
            - statusCode: 200

  # Scenario 4: GraphQL Queries
  - name: "GraphQL Operations"
    weight: 15
    flow:
      - post:
          url: "{{ graphqlUrl }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          json:
            query: |
              query GetWorkflows {
                aiWorkflows(limit: 20) {
                  id
                  type
                  status
                  createdAt
                }
              }
          expect:
            - statusCode: 200
            - hasProperty: data

      - post:
          url: "{{ graphqlUrl }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          json:
            query: |
              query GetTasks {
                aiTasks(limit: 20, status: QUEUED) {
                  id
                  agentType
                  status
                  priority
                }
              }
          expect:
            - statusCode: 200

      - think: 1

      - post:
          url: "{{ graphqlUrl }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          json:
            query: |
              mutation CreateWorkflow($input: CreateAIWorkflowInput!) {
                createAIWorkflow(input: $input) {
                  id
                  type
                  status
                }
              }
            variables:
              input:
                type: "CONTENT_CREATION"
                input:
                  topic: "GraphQL load test"
          expect:
            - statusCode: 200
            - hasProperty: data

  # Scenario 5: Image Generation
  - name: "AI Image Generation"
    weight: 5
    flow:
      - get:
          url: "/api/ai-images/article/{{ articleId }}"
          expect:
            - statusCode: 200
            - hasProperty: images

      - post:
          url: "/api/ai-images/generate"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          json:
            prompt: "Bitcoin cryptocurrency visualization"
            articleId: "{{ articleId }}"
            type: "FEATURED"
          expect:
            - statusCode: 201

  # Scenario 6: Cost & Budget Management
  - name: "Cost Management"
    weight: 5
    flow:
      - get:
          url: "/api/ai/costs/overview"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
            - hasProperty: totalCost

      - get:
          url: "/api/ai/costs/breakdown"
          headers:
            Authorization: "Bearer {{ authToken }}"
          query:
            period: "daily"
            groupBy: "agent"
          expect:
            - statusCode: 200

# After test completion
after:
  flow:
    - log: "Load test completed. Generating report..."